#### Terraform Format and Style 🖌`success`
#### Terraform Initialization ⚙️`success`
#### Terraform Plan 📖`success`
#### Terraform Validation 🤖`success`

<details><summary>Show Plan</summary>

```

terraform
Acquiring state lock. This may take a few moments...
module.kv.data.azurerm_client_config.current: Reading...
data.azurerm_client_config.current: Reading...
module.resource_group.azurerm_resource_group.rg: Refreshing state... [id=/subscriptions/77348e6c-0286-496f-8336-28e966b13648/resourceGroups/rg-biotrackr-prod-ae]
data.azurerm_client_config.current: Read complete after 0s [id=Y2xpZW50Q29uZmlncy9jbGllbnRJZD03ZWM4YjkyZi02NzEyLTRkZDUtOTBiYy1iNmY2NGNjY2ZjMGU7b2JqZWN0SWQ9ZDA1ODQyNGEtYjdjOC00Y2JmLTljYzktNmUwODkxNzAzNTdjO3N1YnNjcmlwdGlvbklkPTc3MzQ4ZTZjLTAyODYtNDk2Zi04MzM2LTI4ZTk2NmIxMzY0ODt0ZW5hbnRJZD1lNjBiYjc2Yy04ZmRhLTRlZDQtYTM1NC00ODM2ZTNiZmNiYzM=]
module.kv.data.azurerm_client_config.current: Read complete after 0s [id=Y2xpZW50Q29uZmlncy9jbGllbnRJZD03ZWM4YjkyZi02NzEyLTRkZDUtOTBiYy1iNmY2NGNjY2ZjMGU7b2JqZWN0SWQ9ZDA1ODQyNGEtYjdjOC00Y2JmLTljYzktNmUwODkxNzAzNTdjO3N1YnNjcmlwdGlvbklkPTc3MzQ4ZTZjLTAyODYtNDk2Zi04MzM2LTI4ZTk2NmIxMzY0ODt0ZW5hbnRJZD1lNjBiYjc2Yy04ZmRhLTRlZDQtYTM1NC00ODM2ZTNiZmNiYzM=]
module.usi.azurerm_user_assigned_identity.msi: Refreshing state... [id=/subscriptions/77348e6c-0286-496f-8336-28e966b13648/resourceGroups/rg-biotrackr-prod-ae/providers/Microsoft.ManagedIdentity/userAssignedIdentities/uai-biotrackr-prod-ae]
module.law.azurerm_log_analytics_workspace.law: Refreshing state... [id=/subscriptions/77348e6c-0286-496f-8336-28e966b13648/resourceGroups/rg-biotrackr-prod-ae/providers/Microsoft.OperationalInsights/workspaces/law-biotrackr-prod-ae]
module.vnet.azurerm_virtual_network.vnet: Refreshing state... [id=/subscriptions/77348e6c-0286-496f-8336-28e966b13648/resourceGroups/rg-biotrackr-prod-ae/providers/Microsoft.Network/virtualNetworks/vnet-biotrackr-prod-ae]
module.kv.azurerm_key_vault.kv: Refreshing state... [id=/subscriptions/77348e6c-0286-496f-8336-28e966b13648/resourceGroups/rg-biotrackr-prod-ae/providers/Microsoft.KeyVault/vaults/kv-biotrackr-prod-ae]
module.mag.azurerm_monitor_action_group.amg: Refreshing state... [id=/subscriptions/77348e6c-0286-496f-8336-28e966b13648/resourceGroups/rg-biotrackr-prod-ae/providers/Microsoft.Insights/actionGroups/Biotrackr-Action-Group]
module.cosmosdb.azurerm_cosmosdb_account.acc: Refreshing state... [id=/subscriptions/77348e6c-0286-496f-8336-28e966b13648/resourceGroups/rg-biotrackr-prod-ae/providers/Microsoft.DocumentDB/databaseAccounts/cosmos-biotrackr-prod-ae]
module.appconfig.azurerm_app_configuration.appconfig: Refreshing state... [id=/subscriptions/77348e6c-0286-496f-8336-28e966b13648/resourceGroups/rg-biotrackr-prod-ae/providers/Microsoft.AppConfiguration/configurationStores/appconfig-biotrackr-prod-ae]
module.sb.azurerm_servicebus_namespace.sb: Refreshing state... [id=/subscriptions/77348e6c-0286-496f-8336-28e966b13648/resourceGroups/rg-biotrackr-prod-ae/providers/Microsoft.ServiceBus/namespaces/sb-biotrackr-prod-ae]
module.acr.azurerm_container_registry.acr: Refreshing state... [id=/subscriptions/77348e6c-0286-496f-8336-28e966b13648/resourceGroups/rg-biotrackr-prod-ae/providers/Microsoft.ContainerRegistry/registries/acrbiotrackrprodae]
module.budget.azurerm_consumption_budget_resource_group.budget: Refreshing state... [id=/subscriptions/77348e6c-0286-496f-8336-28e966b13648/resourceGroups/rg-biotrackr-prod-ae/providers/Microsoft.Consumption/budgets/Biotrackr-Budget]
module.aca_subnet.azurerm_subnet.subnet: Refreshing state... [id=/subscriptions/77348e6c-0286-496f-8336-28e966b13648/resourceGroups/rg-biotrackr-prod-ae/providers/Microsoft.Network/virtualNetworks/vnet-biotrackr-prod-ae/subnets/infrastructure-subnet]
module.ai.azurerm_application_insights.ai: Refreshing state... [id=/subscriptions/77348e6c-0286-496f-8336-28e966b13648/resourceGroups/rg-biotrackr-prod-ae/providers/Microsoft.Insights/components/ai-biotrackr-prod-ae]
module.appconfig_data_reader_role.azurerm_role_assignment.role: Refreshing state... [id=/subscriptions/77348e6c-0286-496f-8336-28e966b13648/resourceGroups/rg-biotrackr-prod-ae/providers/Microsoft.AppConfiguration/configurationStores/appconfig-biotrackr-prod-ae/providers/Microsoft.Authorization/roleAssignments/707c5afd-62cc-3eb1-9ba1-7cb9a746b2ac]
module.cosmosdb.azurerm_cosmosdb_sql_database.db: Refreshing state... [id=/subscriptions/77348e6c-0286-496f-8336-28e966b13648/resourceGroups/rg-biotrackr-prod-ae/providers/Microsoft.DocumentDB/databaseAccounts/cosmos-biotrackr-prod-ae/sqlDatabases/biotrackr]
module.acr_pull_role.azurerm_role_assignment.role: Refreshing state... [id=/subscriptions/77348e6c-0286-496f-8336-28e966b13648/resourceGroups/rg-biotrackr-prod-ae/providers/Microsoft.ContainerRegistry/registries/acrbiotrackrprodae/providers/Microsoft.Authorization/roleAssignments/77495baf-63e2-0545-7992-61421922196c]
module.aca_env.azurerm_container_app_environment.env: Refreshing state... [id=/subscriptions/77348e6c-0286-496f-8336-28e966b13648/resourceGroups/rg-biotrackr-prod-ae/providers/Microsoft.App/managedEnvironments/env-biotrackr-prod-ae]
module.sb_receiver_role.azurerm_role_assignment.role: Refreshing state... [id=/subscriptions/77348e6c-0286-496f-8336-28e966b13648/resourceGroups/rg-biotrackr-prod-ae/providers/Microsoft.ServiceBus/namespaces/sb-biotrackr-prod-ae/providers/Microsoft.Authorization/roleAssignments/aa1b903d-a2db-c941-f269-3599cc278674]
module.sb_sender_role.azurerm_role_assignment.role: Refreshing state... [id=/subscriptions/77348e6c-0286-496f-8336-28e966b13648/resourceGroups/rg-biotrackr-prod-ae/providers/Microsoft.ServiceBus/namespaces/sb-biotrackr-prod-ae/providers/Microsoft.Authorization/roleAssignments/dfe07edc-f8f7-6c73-11c7-fd293e4a5358]
azurerm_container_app_environment_dapr_component.pubsub: Refreshing state... [id=/subscriptions/77348e6c-0286-496f-8336-28e966b13648/resourceGroups/rg-biotrackr-prod-ae/providers/Microsoft.App/managedEnvironments/env-biotrackr-prod-ae/daprComponents/sb-pubsub]
module.activity_queue.azurerm_servicebus_queue.queue: Refreshing state... [id=/subscriptions/77348e6c-0286-496f-8336-28e966b13648/resourceGroups/rg-biotrackr-prod-ae/providers/Microsoft.ServiceBus/namespaces/sb-biotrackr-prod-ae/queues/activity-queue]
module.cosmosdb.azurerm_cosmosdb_sql_container.container: Refreshing state... [id=/subscriptions/77348e6c-0286-496f-8336-28e966b13648/resourceGroups/rg-biotrackr-prod-ae/providers/Microsoft.DocumentDB/databaseAccounts/cosmos-biotrackr-prod-ae/sqlDatabases/biotrackr/containers/fitbitrecords]
azurerm_app_configuration_key.activity_queue_key: Refreshing state... [id=https://appconfig-biotrackr-prod-ae.azconfig.io/kv/biotrackr:activity-queue?label=]

Terraform used the selected providers to generate the following execution
plan. Resource actions are indicated with the following symbols:
  + create

Terraform will perform the following actions:

  # azurerm_app_configuration_key.cosmos_endpoint_key will be created
  + resource "azurerm_app_configuration_key" "cosmos_endpoint_key" {
      + configuration_store_id = "/subscriptions/77348e6c-0286-496f-8336-28e966b13648/resourceGroups/rg-biotrackr-prod-ae/providers/Microsoft.AppConfiguration/configurationStores/appconfig-biotrackr-prod-ae"
      + content_type           = (known after apply)
      + etag                   = (known after apply)
      + id                     = (known after apply)
      + key                    = "biotrackr:cosmosdbendpoint"
      + locked                 = false
      + type                   = "kv"
      + value                  = "https://cosmos-biotrackr-prod-ae.documents.azure.com:443/"
    }

  # module.cosmosdb.azurerm_cosmosdb_sql_role_assignment.custom_role will be created
  + resource "azurerm_cosmosdb_sql_role_assignment" "custom_role" {
      + account_name        = "cosmos-biotrackr-prod-ae"
      + id                  = (known after apply)
      + name                = (known after apply)
      + principal_id        = "db72fc8d-2c24-4f6c-a64f-0f2331cec9dc"
      + resource_group_name = "rg-biotrackr-prod-ae"
      + role_definition_id  = (known after apply)
      + scope               = "cosmos-biotrackr-prod-ae"
    }

  # module.cosmosdb.azurerm_cosmosdb_sql_role_definition.custom_role_definition will be created
  + resource "azurerm_cosmosdb_sql_role_definition" "custom_role_definition" {
      + account_name        = "cosmos-biotrackr-prod-ae"
      + assignable_scopes   = [
          + "/subscriptions/77348e6c-0286-496f-8336-28e966b13648/resourceGroups/rg-biotrackr-prod-ae/providers/Microsoft.DocumentDB/databaseAccounts/cosmos-biotrackr-prod-ae",
        ]
      + id                  = (known after apply)
      + name                = "biotrackr-cosmosdb-role"
      + resource_group_name = "rg-biotrackr-prod-ae"
      + role_definition_id  = (known after apply)
      + type                = "CustomRole"

      + permissions {
          + data_actions = [
              + "Microsoft.DocumentDB/databaseAccounts/readMetadata",
              + "Microsoft.DocumentDB/databaseAccounts/sqlDatabases/containers/*",
              + "Microsoft.DocumentDB/databaseAccounts/sqlDatabases/containers/items/*",
            ]
        }
    }

Plan: 3 to add, 0 to change, 0 to destroy.

─────────────────────────────────────────────────────────────────────────────

Saved the plan to: main.tfplan

To perform exactly these actions, run the following command to apply:
    terraform apply "main.tfplan"
Releasing state lock. This may take a few moments...

```

</details>

*Pushed by: @willvelida, Action: `pull_request`*